import math

#Задача №1
print("Задача №1 \n Задание: Найти результат выражения для произвольных значений a,b,c: a + b * ( c / 2 ) \n Решение:")
a = 2
b = 4
c = 6
decision = a + b * (c / 2)
print(" a = %d; b = %d; c = %d; \n a + b * (c / 2) = %d \n" % (a, b, c, decision))
#----------------------------------------------------

#Задача №2
print("Задача №2 \n Задание: Найти результат выражения для произвольных значений a,b: (a**2 + b**2) % 2 \n Решение:")
a = 2
b = 4
remainder = (a**2 + b**2) % 2
print(" a = %d; b = %d; \n (a**2 + b**2) остаток от деления 2 = %d \n" % (a, b, remainder))
#----------------------------------------------------

#Задача №3
print("Задача №3 \n Найти результат выражения для произвольных значений a,b,c: ( a + b ) / 12 * c % 4 + b \n Решение:")
a = 2
b = 4
c = 6
result = (a + b) / 12 * c % 4 + b
print(" a = %d; b = %d; c = %d; \n (a + b) / 12 * c остаток от деления 4 + b = %d\n" % (a, b, c, result))
#----------------------------------------------------

#Задача №4
print("Задача №4 \n Найти результат выражения для произвольных значений a,b,c: (a - b * c ) / ( a + b ) % c")
a = 2
b = 4
c = 6
answer = (a - b * c) / (a + b) % c
print(" a = %d; b = %d; c = %d; \n (a - b * c) / (a + b) остаток от деления c = %d \n" % (a, b, c, answer))
#----------------------------------------------------

#Задача №5
print("Задача №5 \n Найти результат выражения для произвольных значений a,b,c: |a - b| / (a + b)**3 - cos(c)")
a = 2
b = 4
c = 6
otvet = abs(a - b) / (a + b)**3 - math.cos(c)
print(" a = %d; b = %d; c = %d; Ответ: %.2f" % (a, b, c, otvet))
print("\n")
#----------------------------------------------------

#Задача №6
print("Задача №6 \n Найти результат выражения для произвольных значений a,b,c: (ln(1 + c) / -b)**4 + |a|")
a = 2
b = 4
c = 6
expression = (math.log (1 + c) / -b)**4 + abs(a)
print(" a = %d; b = %d; c = %d; Ответ: = %.2f" % (a, b, c, expression))
#----------------------------------------------------